app/Http/Controllers/HomeController.php

select * from `apps` where `apps`.`deleted_at` is null
---
    public function welcome()
    {
        if (Auth::check()) {
            $user = Auth::user();
            $user_id = $user->person->id;

            if (Session::has('passwords.' . $user_id)) {
                $session_password = Session::get('passwords.' . $user_id);

                if ($user->password === $session_password) {
                    return redirect(route('cefa.password.change.index'));
                }
            }
        }

        $apps = App::all();